package infoexpr.Library.Device.Output;

import lejos.hardware.Sound;
import lejos.utility.Delay;

/*=============================================================
機素  出力機素  スピーカ

指定時間後に、警音や単音を鳴動する
=============================================================*/

public class Speaker
{

	/*---------------------------------------------------------
	コンストラクタ
	---------------------------------------------------------*/

	public Speaker()
	{

	}

	/*---------------------------------------------------------
	ビープ音を鳴らす
	---------------------------------------------------------*/

	public void beep()
	{
		Sound.beep();

	}

	/*---------------------------------------------------------
	指定時間後に警音を鳴動
	---------------------------------------------------------*/

	public void beepAfterTime(int wait)
	{
		Delay.msDelay(wait);
		Sound.beep();
	}

	/*---------------------------------------------------------
	duration時間freqの音を鳴らす
	---------------------------------------------------------*/

	public void playTone(int freq, int duration)
	{
		Sound.playTone(freq, duration);
	}

	/*---------------------------------------------------------
	指定時間後に単音を鳴動
	---------------------------------------------------------*/

	public void toneAfterTime(int wait, int freq, int time)
	{
		Delay.msDelay(wait);
		Sound.playTone(freq, time);
	}

}
